Repository: ritamonteiro1/movielist-app
Catalog: lib/l10n/intl_*.arb
Languages: pt_br

# successfullyRequestMoviesViewAppBarTitle
source: Movie list
pt_br: Lista de filmes

# movieListViewButtonText
source: SEE DETAILS
pt_br: VER DETALHES

# mainContentViewBottomNavigationMovies
source: Movies
pt_br: Filmes

# mainContentViewBottomNavigationAboutEnterprise
source: About enterprise
pt_br: Sobre a empresa

# aboutEnterpriseViewText
source: We are a digital innovation company whose main purpose is to positively transform the world through technology.
pt_br: Somos uma empresa de inovação digital que tem como principal propósito transformar positivamente o mundo através da tecnologia.

# errorViewText
source: Occurred error!
pt_br: Ocorreu um erro!

# errorViewButtonText
source: Try again
pt_br: Tentar novamente

# loadingViewAppBarTitle
source: Loading...
pt_br: Carregando...

# successfullyRequestMovieDetailsViewAppBarTitle
source: Movie details
pt_br: Detalhes do filme

# successfullyRequestMovieDetailsViewVoteAverageText
source: Rating:
pt_br: Avaliação:

# successfullyRequestMovieDetailsViewTitleOriginText
source: Origin title:
pt_br: Título original:

# successfullyRequestMovieDetailsViewGenreText
source: {quantity, plural, one{Genre:} other{Genres:}}
pt_br: {quantity, plural, one{Gênero:} other{Gêneros:}}

# successfullyRequestMovieDetailsViewProductionCompanies
source: {quantity, plural, one{Production company:} other{Production companies:}}
pt_br: {quantity, plural, one{Empresa que produziu:} other{Empresas que produziram:}}

# productionCompanyListViewName
source: Name:
pt_br: Nome:

# productionCompanyCountry
source: Country:
pt_br: País:

# favoriteMoviesViewAppBarTitle
source: Favorite movies
pt_br: Filmes favoritos

# mainContentViewBottomNavigationFavoriteMovies
source: Favorites
pt_br: Favoritos

# successfullyRequestMovieDetailsViewToFavoriteMovie
source: To favorite:
pt_br: Favoritar:

# errorAsyncSnapshotFavoriteMoviesBodyText
source: No favorite movies!
pt_br: Sem filmes favoritos!

# alertDialogTitle
source: Message:
pt_br: Messagem:

# alertDialogMessageSuccessAddMovie
source: Movie added to favorite list!
pt_br: Filme adicionado na lista de favoritos!

# alertDialogMessageErrorAddMovie
source: Error adding movie to favorite list!
pt_br: Erro ao adicionar filme na lista de favoritos!

# alertDialogMessageSuccessRemoveMovie
source: Movie removed from favorite list!
pt_br: Filme removido da lista de favoritos!

# alertDialogMessageErrorRemoveMovie
source: Error removing movie from favorite list!
pt_br: Erro ao remover filme da lista de favoritos!
